icc/14_recursion.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-08-24 dom 11:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Recursión</title>
<meta name="author" content="Davidshiro Pichu" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Recursión</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge8c1667">1. Recursión vs iteración</a></li>
<li><a href="#orgd1fd467">2. Operador ternario</a></li>
<li><a href="#org1f0a0d8">3. Problemas</a>
<ul>
<li><a href="#org684658e">3.1. Suma Gaussiana</a></li>
<li><a href="#org35b4a8e">3.2. Problema 2: Fibonacci</a></li>
<li><a href="#org179f54a">3.3. Problema 3: Arreglo</a></li>
<li><a href="#org7e58c8d">3.4. Problema 4: Primalidad</a></li>
</ul>
</li>
</ul>
</div>
</div>
<blockquote>
<p>
Para saber recursion, hay que saber recursión.
</p>

<p>
&#x2013; Victor Zamora
</p>
</blockquote>

<p>
Recursión es un concepto matemático el cual define una función <i>en
términos de sí misma</i>. Una función en matemáticas es una <i>caja mágica</i>
que da resultados.
</p>

<p>
\[ f(x) = x! \]
</p>

<p>
Así si quiero saber que hace \(f(11)\), la función regresará el valor
<i>factorial</i>, es decir <code>39916800</code>.También hay funciones como el valor
absoluto que se definen por <i>casos</i>
</p>

<p>
\[ abs(x) = \begin{cases} x & \text{si } x \geq 0 \\
-x \text{ en otro caso} \end{cases}\]
</p>

<p>
Particulamente podríamos crear una función \(f(x)\) que se llame a sí
misma, como
</p>

<p>
\[f(x) = x * f(x-1)\]
</p>

<p>
Para calcular \(f(x)\) <b>debemos primero calcular</b> \(f(x-1)\), y si
quisieramos calcular \(f(x-1)\), hay que calcular \(f(x-2)\) y así
sucesivamente; básicamente haríamos algo como
</p>

\begin{align*}
f(11) &= 11 *  f(10) \hspace{2 cm} \text{ y expandimos } f(10)\\
&= 11 * (10 * f(9)) \\
&= 11 * (10 * (9 * f(8))) \\
&= 11 * (10 * (9 * (8 * f(7)))) \hspace{2cm} \text{ y así sucesivamente...}
\end{align*}

<p>
Seguramente ya has visto el problema que <i>nunca terminaríamos</i> de
calcular; incluso pasamos a valores negativos con \(f(1) = 1 * f(0)
\Rightarrow f(0) = 0 * f(-1) \ldots\)
Desde el punto de vista <i>computacional</i> estamos haciendo un <b>ciclo
infinito</b> ya que <i>no tenemos una condición que nos termine el
ciclo</i>. Podemos fácilmente detener esta <i>infinitud</i> si, agregamos
dentro de la definición de la función un <b>caso base</b> para que no
calculemos hasta el infinito
</p>

\begin{align}
f(x) = \begin{cases}
1 \text{ si } x = 0 \\
x * f(x-1) \text{ en otro caso}
\end{cases}
\end{align}

<p>
El primer caso nos <i>detiene</i> cuando llegamos a 0, así  al calcular
\(f(0)\) ya no hacemos más <i>expansiones</i> sino  que lo sustituimos por 1
porque así lo dice la definición.
</p>

\begin{align*}
f(3) &= 3 *  f(2) \\
&= 3 * (2 * f(1)) \\
&= 3 * (2 * (1 * f(0))) \\
&= 3 * (2 * (1 * (1))) \hspace{2cm} \text{ fin de la recursión}\\
&= 3 * (2 * (1 * 1)) \hspace{2cm} \text{ regresamos la recursión}\\
&= 3 * (2 * (1)) \\
&= 3 * (2)\\
&= 6
\end{align*}

<p>
Claramente tenemos una <i>ecuación</i> con valores fijos que podemos
calcular. Computacionalmente vamos calculando <i>desde lo más adentro</i>
hasta afuera, es decir empezamos por \((1*(1))\) y esto nos da como
resultado \(1\), luego \((2 * (1)\) que nos da \(2\) y así sucesivamente.
</p>

<p>
Como puedes notar, \(f(x)\) es la función de factorial. Es equivalente a
su versión <i>iterativa</i> como
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #00578E; font-weight: bold;">facIt</span>(<span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #0084C8; font-weight: bold;">n</span>){
    <span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #0084C8; font-weight: bold;">r</span> = 1;
    <span style="color: #A52A2A; font-weight: bold;">while</span> (n &gt; 0){
        r = r * n;
        n--;
    }
    <span style="color: #A52A2A; font-weight: bold;">return</span> r;
}
</pre>
</div>

<p>
En cuanto a <i>programar recursivamente</i> se pone un poco interesante, ya
que <b>debemos llamar al mismo método</b> hasta cumplir con el caso
base. Aplicando la definición (1) tenemos el siguiente código.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #00578E; font-weight: bold;">facRec</span>(<span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #0084C8; font-weight: bold;">n</span>){
    <span style="color: #A52A2A; font-weight: bold;">if</span> (n == 0) <span style="color: #204A87;">//</span><span style="color: #204A87;">Caso base
</span>        <span style="color: #A52A2A; font-weight: bold;">return</span> 1;
    <span style="color: #A52A2A; font-weight: bold;">else</span> <span style="color: #204A87;">// </span><span style="color: #204A87;">En otro caso (caso recursivo)
</span>        <span style="color: #A52A2A; font-weight: bold;">return</span> n * facRec(n -1);
}      
</pre>
</div>

<p>
Cuando hacemos un ciclo ya sea iterativo o <i>recursivo</i> debemos cumplir
con:
</p>

<dl class="org-dl">
<dt>Tener un valor inicial</dt><dd>El valor <code>n</code> que se manda a llamar <code>facRec(n)</code></dd>
<dt>Tener una condición para <i>finalizar</i></dt><dd>El caso base, cuando <code>n == 0</code></dd>
<dt>En cada iteración hacer un cambio <i>para llegar a la condición</i>.</dt><dd>El caso recursivo, y decrementamos <code>n</code> en 1 para la siguiente
llamada recursiva.</dd>
</dl>


<p>
Lo que sucede internamente dentro de <i>Java</i> es que como se va llamando
el método <b>a sí mismo</b> estas llamadas se van <i>apilando</i> internamente,
como una pila de libros donde la última llamada será la primera en ser
calculada, si es que puede ser calculada, y si no creara la próxima
llamada. 
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">APILADO</th>
<th scope="col" class="org-left">Calcular</th>
<th scope="col" class="org-left">valor a devolver</th>
<th scope="col" class="org-left">~</th>
<th scope="col" class="org-left">sustitución</th>
<th scope="col" class="org-left">Orden calculo</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">END</td>
<td class="org-left">f(0)</td>
<td class="org-left">1</td>
<td class="org-left">~</td>
<td class="org-left">1 = <span class="underline">1</span></td>
<td class="org-left">START</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">f(1)</td>
<td class="org-left">1 * f(0)</td>
<td class="org-left">~</td>
<td class="org-left">1 * <span class="underline">1</span> = 1</td>
<td class="org-left">.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">f(2)</td>
<td class="org-left">2 * f(1)</td>
<td class="org-left">~</td>
<td class="org-left">2 * <span class="underline">1</span> = 2</td>
<td class="org-left">.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">f(3)</td>
<td class="org-left">3 * f(2)</td>
<td class="org-left">~</td>
<td class="org-left">3 * <span class="underline">2</span> = 6</td>
<td class="org-left">v</td>
</tr>

<tr>
<td class="org-left">START</td>
<td class="org-left">f(4)</td>
<td class="org-left">4 * f(3)</td>
<td class="org-left">~</td>
<td class="org-left">4 * <span class="underline">6</span> = 24</td>
<td class="org-left">END</td>
</tr>
</tbody>
</table>




<p>
La pila empieza cuando queremos calcular \(f(4)\) y esta se va llenando
hacia arriba, es decir \(f(4) = 4 * f(3)\), entonces manda a llamar a
esta misma función pero ahora con el valor de 3 \(f(3)\) el cual se
apila y se calcula como \(f(3) = 3 * f(2)\); nuevamente vuelve a llamar
a este mismo método con el valor 2 \(f(2)\) pero para poderlo calcular
necesita calcular \(2 * f(1)\) y vuelve a <b>apliar</b> la llamada \(f(1)\), el
cual regresará lo que resulte de \(1 * f(0)\). Finalmente llama a \(f()\)
con 0 y por definición de caso base, \(f(0) = 1\) por lo que ya no tiene
que apilar más llamadas y va <i>desapilando</i> en el mismo orden que fue
apilado, regresando el resultado o sustituyendolo en donde tenia la
función pendiente a calcular.
</p>
<div id="outline-container-orge8c1667" class="outline-2">
<h2 id="orge8c1667"><span class="section-number-2">1.</span> Recursión vs iteración</h2>
<div class="outline-text-2" id="text-1">
<p>
Hay problemas donde es mejor utilizar <i>recursión</i> que <i>iteraciones</i>, y
otros problemas donde es mejor <i>viceversa</i>. Cada uno tiene sus
ventajas y desventajas.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Recursión</th>
<th scope="col" class="org-left">Iteración</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Pros</td>
<td class="org-left">Menos código</td>
<td class="org-left">Más rápido</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Fácil de entender y demostrar</td>
<td class="org-left">Mínimo uso de memoria</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Ideal para estructuras recursivas</td>
<td class="org-left">Fácil anidar ciclos</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">contras</td>
<td class="org-left">Uso de más memoria (pila de ejcución)</td>
<td class="org-left">código spaguetti</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">ciclos infinitos son complicados (lazy vs greedy)</td>
<td class="org-left">Un cohete en estructuras no recursivas</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgd1fd467" class="outline-2">
<h2 id="orgd1fd467"><span class="section-number-2">2.</span> Operador ternario</h2>
<div class="outline-text-2" id="text-2">
<p>
Nuestro único método se ve como
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #00578E; font-weight: bold;">facRec</span>(<span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #0084C8; font-weight: bold;">n</span>){
    <span style="color: #A52A2A; font-weight: bold;">if</span> (n == 0) <span style="color: #204A87;">//</span><span style="color: #204A87;">Caso base
</span>        <span style="color: #A52A2A; font-weight: bold;">return</span> 1;
    <span style="color: #A52A2A; font-weight: bold;">else</span> <span style="color: #204A87;">// </span><span style="color: #204A87;">En otro caso (caso recursivo)
</span>        <span style="color: #A52A2A; font-weight: bold;">return</span> n * facRec(n -1);
}      
</pre>
</div>

<p>
En <i>Java</i> podemos reducirlo a 1 línea utilizando la sintaxis del
<b>operador ternario</b> (también conocido como <i>azúcar sintáctica</i>), el
cual como su nombre lo indica, tiene 3 campos a rellenar. El anterior
código es equivalente a
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #00578E; font-weight: bold;">facRec</span>(<span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #0084C8; font-weight: bold;">n</span>){
    <span style="color: #A52A2A; font-weight: bold;">return</span> n == 0 ? 1 : n * facRec(n -1);
}
</pre>
</div>

<p>
Donde
</p>
<ul class="org-ul">
<li><code>n == 0 ?</code> equivale a preguntar la condición del <code>if</code></li>
<li><code>1</code> es el resultado a devolver si se cumple la condición anterior.</li>
<li><code>: n * facRec(n -1)</code> es el caso <i>else</i> cuando no se cumple el <code>if</code></li>
</ul>
</div>
</div>
<div id="outline-container-org1f0a0d8" class="outline-2">
<h2 id="org1f0a0d8"><span class="section-number-2">3.</span> Problemas</h2>
<div class="outline-text-2" id="text-3">
<p>
Para estos problemas <b>no puedes usar</b> <code>for</code>,  <code>while</code> ni <code>do-while</code>.
</p>
</div>
<div id="outline-container-org684658e" class="outline-3">
<h3 id="org684658e"><span class="section-number-3">3.1.</span> Suma Gaussiana</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Anteriormente calculamos la suma de los primeros <i>N</i> naturales como
\[\sum_{i=0}^{N}i = 0 + 1 + 2 + 3 + 4 + \ldots + N\]
</p>

<p>
Con un código iterativo como
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #A52A2A; font-weight: bold;">class</span> <span style="color: #2F8B58; font-weight: bold;">Gaussiana</span> {
    <span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #A52A2A; font-weight: bold;">static</span> <span style="color: #2F8B58; font-weight: bold;">void</span> <span style="color: #00578E; font-weight: bold;">main</span>(<span style="color: #2F8B58; font-weight: bold;">String</span>[] <span style="color: #0084C8; font-weight: bold;">args</span>){
        <span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #0084C8; font-weight: bold;">n</span> = Integer.parseInt(args[0]);
        <span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #0084C8; font-weight: bold;">suma</span> = gaussiana(n);
        System.out.println(<span style="color: #4E9A06;">"La suma gaussiana es "</span> + suma);
    }

    <span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #A52A2A; font-weight: bold;">static</span> <span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #00578E; font-weight: bold;">gaussiana</span>(<span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #0084C8; font-weight: bold;">n</span>){
        <span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #0084C8; font-weight: bold;">s</span> = 0;
        <span style="color: #A52A2A; font-weight: bold;">for</span> (<span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #0084C8; font-weight: bold;">i</span> = 0; i &lt;= n; i++)
            s += i;
        <span style="color: #A52A2A; font-weight: bold;">return</span> s;
    }
}
</pre>
</div>

<p>
Convierte este código a su forma <i>recursiva</i>. <b>Hint</b> Fijate en la
definición de factorial.
</p>
</div>
</div>
<div id="outline-container-org35b4a8e" class="outline-3">
<h3 id="org35b4a8e"><span class="section-number-3">3.2.</span> Problema 2: Fibonacci</h3>
<div class="outline-text-3" id="text-3-2">
<p>
La sucesión de <a href="https://es.wikipedia.org/wiki/Sucesi%C3%B3n_de_Fibonacci">Fibonacci</a> es una sucesión muy presente en la naturaleza
como reproducción de conejos, su forma de calcular el <i>N-ésimo</i> dígito
en la sucesión \(f(n)\) se define para número naturales como:
</p>

\begin{equation}
f(n) = \begin{cases}
f(0) = 0 \\
f(1) = 1 \\
f(n-1) + f(n-2) \text{ en otro caso.}
\end{cases}
\end{equation}
<p>
Crea un método que calcule el <i>N-ésimo</i> número en la sucesión de
fibonacci <i>recursivamente</i>.
</p>
</div>
</div>
<div id="outline-container-org179f54a" class="outline-3">
<h3 id="org179f54a"><span class="section-number-3">3.3.</span> Problema 3: Arreglo</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Crea un arreglo de tamaño <i>N</i> dado por el usuario. Llena el arreglo
<i>recursivamente</i> con valores de 0  a <i>N-1</i> en orden.
</p>
</div>
</div>
<div id="outline-container-org7e58c8d" class="outline-3">
<h3 id="org7e58c8d"><span class="section-number-3">3.4.</span> Problema 4: Primalidad</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Dado un número <i>N</i> positivo, decidir si es primo o no. Recuerda la
definición de número primo. 
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Davidshiro Pichu</p>
<p class="date">Created: 2025-08-24 dom 11:14</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
